component = require '../../utils/component'
{toDate, monthToString} = require '../../utils'

module.exports = component 'views', ({dom, state}, userId) ->
  {E, append} = dom

  view = E()

  state.applicants.on once: true, (applicants) ->
    [applicant] = applicants.filter (applicant) -> applicant.userId is userId
    {applicantData} = applicant

    birthdayString = applicant.birthday.split '/'
    birthdayString[1] = monthToString birthdayString[1]
    birthdayString = [birthdayString[2], birthdayString[1], birthdayString[0]].join ' '

    append view, [
      E 'h1', null, 'مشخصات کلی'
      E null, "#{applicant.firstName} #{applicant.lastName}"
      E null, 'متولد ' + birthdayString
      E null, 'کد ملی: ' + applicant.identificationCode
      E null, 'تاریخ ثبت: ' + toDate applicant.modificationTime
      E 'h4', null, 'شغل‌های درخواستی'
      applicant.selectedJobs.map ({jobName}) ->
        E null, ' - ' + jobName

      E 'h1', null, 'مشخصات فردی'
      E null, 'جنسیت: ' + applicantData['مشخصات فردی']['جنسیت']
      E null, 'نام پدر: ' + applicantData['مشخصات فردی']['نام پدر']
      E null, 'شماره شناسنامه: ' + applicantData['مشخصات فردی']['شماره شناسنامه']
      E null, 'محل تولد: ' + applicantData['مشخصات فردی']['محل تولد']
      E null, 'محل صدور: ' + applicantData['مشخصات فردی']['محل صدور']
      E null, 'ملیت: ' + applicantData['مشخصات فردی']['ملیت']
      E null, 'تابعیت: ' + applicantData['مشخصات فردی']['تابعیت']
      E null, 'دین: ' + applicantData['مشخصات فردی']['دین']
      E null, 'تاریخ تولد: ' + applicantData['مشخصات فردی']['تاریخ تولد']
      if applicantData['مشخصات فردی']?['جنسیت'] is 'مرد'
        [
          E null, 'وضعیت نظام وظیفه: ' + applicantData['مشخصات فردی']['وضعیت نظام وظیفه']
          if applicantData['مشخصات فردی']?['وضعیت نظام وظیفه'] is 'معاف'
            [
              E null, 'نوع معافیت: ' + applicantData['مشخصات فردی']['نوع معافیت']
              if applicantData['مشخصات فردی']?['نوع معافیت'] is 'معافیت پزشکی'
                E null, 'دلیل معافیت: ' + applicantData['مشخصات فردی']['دلیل معافیت']
            ]
        ]
      E null, 'وضعیت تاهل: ' + applicantData['مشخصات فردی']['وضعیت تاهل']
      unless applicantData['مشخصات فردی']?['وضعیت تاهل'] is 'مجرد'
        E null, 'تعداد فرزندان: ' + applicantData['مشخصات فردی']['تعداد فرزندان']
      E null, 'تعداد افراد تحت تکفل: ' + applicantData['مشخصات فردی']['تعداد افراد تحت تکفل']
      E null, 'نام معرف: ' + applicantData['مشخصات فردی']['نام معرف']
      E 'h4', null, 'ایمیل'
      E englishText: ' - ' + applicant.email
      applicantData['مشخصات فردی']['ایمیل'].map (x) ->
        E englishText: ' - ' + x
      E 'h4', null, 'تلفن همراه'
      E null, ' - ' + applicant.phoneNumber
      applicantData['مشخصات فردی']['تلفن همراه'].map (x) ->
        E null, ' - ' + x
      E null, 'آدرس محل سکونت دائم: ' + applicantData['مشخصات فردی']['آدرس محل سکونت دائم']
      E null, 'تلفن محل ثابت سکونت دائم: ' + applicantData['مشخصات فردی']['تلفن ثابت محل سکونت دائم']
      E null, 'آدرس محل سکونت فعلی: ' + applicantData['مشخصات فردی']['آدرس محل سکونت فعلی']
      E null, 'تلفن محل ثابت سکونت فعلی: ' + applicantData['مشخصات فردی']['تلفن ثابت محل سکونت فعلی']
    
      E 'h1', null, 'سوابق تحصیلی'
      applicantData['سوابق تحصیلی']['سوابق تحصیلی'].map (x) -> [
        E null, 'مقطع: ' + x['مقطع']
        E null, 'رشته تحصیلی: ' + x['رشته تحصیلی']
        E null, 'نام دانشگاه و شهر محل تحصیل: ' + x['نام دانشگاه و شهر محل تحصیل']
        E null, 'سال ورود: ' + x['سال ورود']
        E null, 'سال اخذ مدرک: ' + x['سال اخذ مدرک']
        E null, 'معدل: ' + x['معدل']
        E null, 'عنوان پایان‌نامه: ' + x['عنوان پایان‌نامه']
        E null, '------------------------------'
      ]
      if applicantData['سوابق تحصیلی']?['مقطع و رشته‌ای که ادامه می‌دهید']
        [
          E null, 'آیا مایل به ادامه تحصیل در سال‌های آینده هستید (مقطع و رشته‌ای که ادامه می‌دهید را ذکر کنید)؟'
          E null, applicantData['سوابق تحصیلی']['مقطع و رشته‌ای که ادامه می‌دهید']
        ]

      E 'h1', null, 'توانمندی‌ها، مهارت‌ها، دانش و شایستگی‌ها'
      E 'h4', null, 'مهارت‌ها'
      if applicantData['توانمندی‌ها، مهارت‌ها، دانش و شایستگی‌ها']?['مهارت‌ها']
        applicantData['توانمندی‌ها، مهارت‌ها، دانش و شایستگی‌ها']['مهارت‌ها'].map (x) -> [
          E null, 'شایستگی / مهارت: ' + x['شایستگی / مهارت']
          E null, 'علاقه به کار در این حوزه: ' + x['علاقه به کار در این حوزه']
          E null, 'دانش و مهارت در این حوزه: ' + x['دانش و مهارت در این حوزه']
          E null, '------------------------------'
        ]
      E 'h4', null, 'دوره‌ها'
      if applicantData['توانمندی‌ها، مهارت‌ها، دانش و شایستگی‌ها']?['دوره‌ها']
        applicantData['توانمندی‌ها، مهارت‌ها، دانش و شایستگی‌ها']['دوره‌ها'].map (x) -> [
          E null, 'دوره: ' + x['دوره']
          E null, 'برگزار کننده: ' + x['برگزار کننده']
          E null, 'سال: ' + x['سال']
          E null, '------------------------------'
        ]
      if applicantData['توانمندی‌ها، مهارت‌ها، دانش و شایستگی‌ها']?['نکات تکمیلی قابل ذکر در دوره‌های آموزشی گذرانده شده']
        [
          E 'h4', null, 'نکات تکمیلی قابل ذکر در دوره‌های آموزشی گذرانده شده:'
          E null, applicantData['توانمندی‌ها، مهارت‌ها، دانش و شایستگی‌ها']['نکات تکمیلی قابل ذکر در دوره‌های آموزشی گذرانده شده']
        ]
      if applicantData['توانمندی‌ها، مهارت‌ها، دانش و شایستگی‌ها']?['آثار علمی و عضویت در انجمن‌ها']
        [
          E 'h4', null, 'آثار علمی و عضویت در انجمن‌ها:'
          E null, applicantData['توانمندی‌ها، مهارت‌ها، دانش و شایستگی‌ها']['آثار علمی و عضویت در انجمن‌ها']
        ]

      E 'h1', null, 'مهارت زبان انگلیسی'
      E null, 'مکالمه: ' + applicantData['مهارت زبان انگلیسی']['مکالمه']
      E null, 'نوشتن: ' + applicantData['مهارت زبان انگلیسی']['نوشتن']
      E null, 'خواندن: ' + applicantData['مهارت زبان انگلیسی']['خواندن']

      E 'h1', null, 'آخرین سوابق سازمانی و پروژه‌ای'
      if applicantData['آخرین سوابق سازمانی و پروژه‌ای']?['آخرین سوابق سازمانی و پروژه‌ای']
        applicantData['آخرین سوابق سازمانی و پروژه‌ای']['آخرین سوابق سازمانی و پروژه‌ای'].map (x) -> [
          E null, 'نام: ' + x['نام']
          E null, 'نوع فعالیت: ' + x['نوع فعالیت']
          E null, 'نام مدیر عامل: ' + x['نام مدیر عامل']
          E null, 'نام مدیر مستقیم: ' + x['نام مدیر مستقیم']
          E null, 'تلفن: ' + x['تلفن']
          E null, 'محدوده نشانی: ' + x['محدوده نشانی']
          E null, 'تاریخ شروع: ' + x['تاریخ شروع']
          E null, 'تاریخ پایان: ' + x['تاریخ پایان']
          E null, 'نوع همکاری: ' + x['نوع همکاری']
          E null, 'علت خاتمه همکاری: ' + x['علت خاتمه همکاری']
          E null, 'آخرین خالص دریافتی: ' + x['آخرین خالص دریافتی']
          E null, 'شرح مهمترین اقدامات صورت گرفته / مهمترین شرح وظایف: ' + x['شرح مهمترین اقدامات صورت گرفته / مهمترین شرح وظایف']
          E null, '------------------------------'
        ]
    
      E 'h1', null, 'سایر اطلاعات'
      E 'h4', null, 'متقاضی چه نوع همکاری هستید؟'
      E null, applicantData['سایر اطلاعات']['متقاضی چه نوع همکاری هستید']
      E 'h4', null, 'از چه طریقی از فرصت شغلی در داتین مطلع شدید؟'
      E null, applicantData['سایر اطلاعات']['از چه طریقی از فرصت شغلی در داتین مطلع شدید']
      if applicantData['سایر اطلاعات']?['از چه تاریخی می‌توانید همکاری خود را با داتین آغاز کنید']
        [
          E 'h4', null, 'از چه تاریخی می‌توانید همکاری خود را با داتین آغاز کنید؟'
          E null, applicantData['سایر اطلاعات']['از چه تاریخی می‌توانید همکاری خود را با داتین آغاز کنید']
        ]
      if applicantData['سایر اطلاعات']?['نوع بیمه‌ای که تا‌به‌حال داشته‌اید']
        [
          E 'h4', null, 'نوع بیمه‌ای که تا‌به‌حال داشته‌اید؟'
          E null, applicantData['سایر اطلاعات']['نوع بیمه‌ای که تا‌به‌حال داشته‌اید']
        ]
      E 'h4', null, 'مدت زمانی که بیمه بوده‌اید'
      E null, applicantData['سایر اطلاعات']['مدت زمانی که بیمه بوده‌اید']
      E 'h4', null, 'میزان دستمزد؟'
      E null, applicantData['سایر اطلاعات']['میزان دستمزد']
      if applicantData['سایر اطلاعات']?['مقدار دستمزد']
        [
          E 'h4', null, 'مقدار دستمزد؟'
          E null, applicantData['سایر اطلاعات']['مقدار دستمزد']
        ]
      E 'h4', null, 'در صورتی که شغل مورد نظر شما نیاز به موارد زیر داشته باشد، آیا می‌توانید:'
      E null, 'در ساعات اضافه کاری حضور داشته و کار کنید - ' + applicantData['سایر اطلاعات']['در ساعات اضافه کاری حضور داشته و کار کنید']
      E null, 'در صورت لزوم در ساعات غیر اداری به شرکت مراجعه کنید - ' + applicantData['سایر اطلاعات']['در صورت لزوم در ساعات غیر اداری به شرکت مراجعه کنید']
      E null, 'در شیفت شب کار کنید - ' + applicantData['سایر اطلاعات']['در شیفت شب کار کنید']
      E null, 'در تعطیلات آخر هفته کار کنید - ' + applicantData['سایر اطلاعات']['در تعطیلات آخر هفته کار کنید']
      E null, 'در شهر تهران غیر از محل شرکت مشغول کار شوید - ' + applicantData['سایر اطلاعات']['در شهر تهران غیر از محل شرکت مشغول کار شوید']
      E 'h4', null, 'مشخصات دو نفر از کسانی که شما را بشناسند و توانایی کاری شما را تایید کنند:'
      if applicantData['سایر اطلاعات']?['مشخصات دو نفر از کسانی که شما را بشناسند و توانایی کاری شما را تایید کنند']
        applicantData['سایر اطلاعات']['مشخصات دو نفر از کسانی که شما را بشناسند و توانایی کاری شما را تایید کنند'].map (x) -> [
          E null, 'نام و نام خانوادگی: ' + x['نام و نام خانوادگی']
          E null, 'نسبت با شما: ' + x['نسبت با شما']
          E null, 'نام محل کار: ' + x['نام محل کار']
          E null, 'سمت: ' + x['سمت']
          E null, 'شماره تماس: ' + x['شماره تماس']
          E null, '------------------------------'
        ]
      E 'h4', null, 'در صورتی که فردی از آشنایان و بستگان شما در شرکت داتین، گروه هولدینگ فناپ و یا گروه مالی پاسارگاد مشغول به کار هستند، نام ببرید:'
      if applicantData['سایر اطلاعات']?['در صورتی که فردی از آشنایان و بستگان شما در شرکت داتین، گروه هولدینگ فناپ و یا گروه مالی پاسارگاد مشغول به کار هستند، نام ببرید']
        applicantData['سایر اطلاعات']['در صورتی که فردی از آشنایان و بستگان شما در شرکت داتین، گروه هولدینگ فناپ و یا گروه مالی پاسارگاد مشغول به کار هستند، نام ببرید'].map (x) -> [
          E null, 'نام و نام خانوادگی: ' + x['نام و نام خانوادگی']
          E null, 'سمت: ' + x['سمت']
          E null, 'نام محل کار: ' + x['نام محل کار']
          E null, 'نسبت با شما: ' + x['نسبت با شما']
          E null, 'شماره تماس: ' + x['شماره تماس']
          E null, '------------------------------'
        ]
      if applicantData['سایر اطلاعات']?['ورزش‌های مورد علاقه']
        [
          E 'h4', null, 'ورزش‌های مورد علاقه:'
          E null, applicantData['سایر اطلاعات']?['ورزش‌های مورد علاقه']
        ]
      if applicantData['سایر اطلاعات']?['زمینه‌های هنری مورد علاقه']
        [
          E 'h4', null, 'زمینه‌های هنری مورد علاقه:'
          E null, applicantData['سایر اطلاعات']?['زمینه‌های هنری مورد علاقه']
        ]
      E null, 'آیا به بیماری خاصی که نیاز به مراقبت‌های ویژه داشته‌باشد، مبتلا هستید، یا نقص عضو یا عمل جراحی مهمی داشته‌اید؟: ' + applicantData['سایر اطلاعات']?['آیا به بیماری خاصی که نیاز به مراقبت‌های ویژه داشته‌باشد، مبتلا هستید، یا نقص عضو یا عمل جراحی مهمی داشته‌اید']
      if applicantData['سایر اطلاعات']?['نوع آن را ذکر نمایید']
        E null, 'نوع آن را ذکر نمایید. - ' + applicantData['سایر اطلاعات']['نوع آن را ذکر نمایید']
      E null, 'آیا دخانیات مصرف می‌کنید؟: ' + applicantData['سایر اطلاعات']?['آیا دخانیات مصرف می‌کنید']
      E null, 'آیا سابقه محکومیت کیفری دارید؟: ' + applicantData['سایر اطلاعات']?['آیا سابقه محکومیت کیفری دارید']
      if applicantData['سایر اطلاعات']?['تاریخ، دلایل و مدت آن را توضیح دهید']
        E null, 'تاریخ، دلایل و مدت آن را توضیح دهید. - ' + applicantData['سایر اطلاعات']['تاریخ، دلایل و مدت آن را توضیح دهید']
    ]

    window.print()

  view