E 'h4', null, 'در صورتی که شغل مورد نظر شما نیاز به موارد زیر داشته باشد، آیا می‌توانید:'
E null, 'در ساعات اضافه کاری حضور داشته و کار کنید - ' + applicantData['سایر اطلاعات']['در ساعات اضافه کاری حضور داشته و کار کنید']
E null, 'در صورت لزوم در ساعات غیر اداری به شرکت مراجعه کنید - ' + applicantData['سایر اطلاعات']['در صورت لزوم در ساعات غیر اداری به شرکت مراجعه کنید']
E null, 'در شیفت شب کار کنید - ' + applicantData['سایر اطلاعات']['در شیفت شب کار کنید']
E null, 'در تعطیلات آخر هفته کار کنید - ' + applicantData['سایر اطلاعات']['در تعطیلات آخر هفته کار کنید']
E null, 'در شهر تهران غیر از محل شرکت مشغول کار شوید - ' + applicantData['سایر اطلاعات']['در شهر تهران غیر از محل شرکت مشغول کار شوید']
E 'h4', null, 'مشخصات دو نفر از کسانی که شما را بشناسند و توانایی کاری شما را تایید کنند:'
if applicantData['سایر اطلاعات']?['مشخصات دو نفر از کسانی که شما را بشناسند و توانایی کاری شما را تایید کنند']
  applicantData['سایر اطلاعات']['مشخصات دو نفر از کسانی که شما را بشناسند و توانایی کاری شما را تایید کنند'].map (x) -> [
    E null, 'نام و نام خانوادگی: ' + x['نام و نام خانوادگی']
    E null, 'نسبت با شما: ' + x['نسبت با شما']
    E null, 'نام محل کار: ' + x['نام محل کار']
    E null, 'سمت: ' + x['سمت']
    E null, 'شماره تماس: ' + x['شماره تماس']
    E null, '------------------------------'
  ]
E 'h4', null, 'در صورتی که فردی از آشنایان و بستگان شما در شرکت داتین، گروه هولدینگ فناپ و یا گروه مالی پاسارگاد مشغول به کار هستند، نام ببرید:'
if applicantData['سایر اطلاعات']?['در صورتی که فردی از آشنایان و بستگان شما در شرکت داتین، گروه هولدینگ فناپ و یا گروه مالی پاسارگاد مشغول به کار هستند، نام ببرید']
  applicantData['سایر اطلاعات']['در صورتی که فردی از آشنایان و بستگان شما در شرکت داتین، گروه هولدینگ فناپ و یا گروه مالی پاسارگاد مشغول به کار هستند، نام ببرید'].map (x) -> [
    E null, 'نام و نام خانوادگی: ' + x['نام و نام خانوادگی']
    E null, 'سمت: ' + x['سمت']
    E null, 'نام محل کار: ' + x['نام محل کار']
    E null, 'نسبت با شما: ' + x['نسبت با شما']
    E null, 'شماره تماس: ' + x['شماره تماس']
    E null, '------------------------------'
  ]
if applicantData['سایر اطلاعات']?['ورزش‌های مورد علاقه']
  [
    E 'h4', null, 'ورزش‌های مورد علاقه:'
    E null, applicantData['سایر اطلاعات']?['ورزش‌های مورد علاقه']
  ]
if applicantData['سایر اطلاعات']?['زمینه‌های هنری مورد علاقه']
  [
    E 'h4', null, 'زمینه‌های هنری مورد علاقه:'
    E null, applicantData['سایر اطلاعات']?['زمینه‌های هنری مورد علاقه']
  ]
E null, 'آیا به بیماری خاصی که نیاز به مراقبت‌های ویژه داشته‌باشد، مبتلا هستید، یا نقص عضو یا عمل جراحی مهمی داشته‌اید؟: ' + applicantData['سایر اطلاعات']?['آیا به بیماری خاصی که نیاز به مراقبت‌های ویژه داشته‌باشد، مبتلا هستید، یا نقص عضو یا عمل جراحی مهمی داشته‌اید']
if applicantData['سایر اطلاعات']?['نوع آن را ذکر نمایید']
  E null, 'نوع آن را ذکر نمایید. - ' + applicantData['سایر اطلاعات']['نوع آن را ذکر نمایید']
E null, 'آیا دخانیات مصرف می‌کنید؟: ' + applicantData['سایر اطلاعات']?['آیا دخانیات مصرف می‌کنید']
E null, 'آیا سابقه محکومیت کیفری دارید؟: ' + applicantData['سایر اطلاعات']?['آیا سابقه محکومیت کیفری دارید']
if applicantData['سایر اطلاعات']?['تاریخ، دلایل و مدت آن را توضیح دهید']
  E null, 'تاریخ، دلایل و مدت آن را توضیح دهید. - ' + applicantData['سایر اطلاعات']['تاریخ، دلایل و مدت آن را توضیح دهید']