module.exports = [{
  question: 'آیا شناختن شما'
  answers: [
    'اسان است، یا'
    'دشوار است؟'
  ]
}, {
  question: 'برای انجام یک کار، آیا'
  answers: [
    'آن را زود شروع کرده طوری که پس از پایان کار وقت اضافی داشته باشید؟'
    'آن را به لحظه ی آخر واگذار کرده و سعی می کنید با نهایت سرعت آن را انجام دهید؟'
  ]
}, {
  question: 'آیا'
  answers: [
    'با هرکسی تا حدی که لازم می دانید به راحتی صحبت می کنید؟'
    'فقط با افراد خاصی آن هم در شرایط خاصی می توانید زیاد صحبت کنید؟'
  ]
}, {
  question: 'ترجیح می دهید در نظر مردم چگونه باشید؟'
  answers: [
    'فردی اهل عمل'
    'فردی خلاق و مبتکر'
  ]
}, {
  question: 'اگر می خواستید در همسایگی خود برای مسائلی مانند کمک صلیب سرخ به جمع آوری اعانه از دیگران بپردازید، درخواست شما …'
  answers: [
    'خلاصه و تجاری می بود؟'
    'دوستانه و اجتماعی می بود؟'
  ]
}, {
  question: 'شما معمولا'
  answers: [
    'زود جوش'
    'آرام و درون گرا هستید'
  ]
}, {
  question: 'هنگامی که رخدادی پیش بینی نشده شما را مجبور به کنار گذاشتن برنامه روزانه تان می کند، آیا'
  answers: [
    'به وجود آمدن وقفه در برنامه تان را مزاحمت تلقی می کنید?'
    'با تغییر وضعیت پیش آمده با خوشرویی برخورد می کنید؟'
  ]
}, {
  question: 'هنگام مطالعه با هدف سرگرم شدن'
  answers: [
    'از شیوه بیان عجیب و ابتکاری لذت می برید، یا'
    'نویسندگانی را دوست دارید که به روشنی منظور خود را می رسانند؟'
  ]
}, {
  question: 'کدام گزاره تعریف و تمجید بیشتری از شما به شمار می‌آید؟'
  answers: [
    'شخصی با احساسات واقعی'
    'شخصی همیشه منطقی؟'
  ]
}, {
  question: 'روابط دوستانه شما'
  answers: [
    'با افرادی معدود، ولی عمیق است'
    'با تعداد بسیاری از افراد، ولی سطحی است'
  ]
}, {
  question: 'آیا در تصمیم گیری، بیشتر'
  answers: [
    'قلبتان بر عقلتان غلبه دارد؟'
    'عقلتان بر قلبتان؟'
  ]
}, {
  question: 'می توانید به طور نامحدود'
  answers: [
    'فقط با کسانی که علایق مشترکی با شما دارند صحبت کنید'
    'می توانید با هر کسی صحبت کنید'
  ]
}, {
  question: 'آیا مطابق برنامه عمل کردن'
  answers: [
    'مورد رضایت شماست، یا'
    'شما را در تنگنا قرار می دهد؟'
  ]
}, {
  question: 'هنگام شروع یک پروژه ی بزرگ تا یک هفته باید انجام شود، آیا'
  answers: [
    'زمانی را برای تهیه فهرستی از کارهایی که می بایست انجام شوند بر اساس اولویت در نظر می گیرید'
    'دل به دریا می زنید و شروع می کنید؟'
  ]
}, {
  question: 'در صحبت کردن با دوستانتان، آیا'
  answers: [
    'گاهی مسایل شخصی را به طور خصوصی به آنان می گویید'
    'تقزیبا هرگز چیزی را که نمی خواهید بگویید بیان نمی کنید؟'
  ]
}, {
  question: 'اگر معلم بودید ترجیح می دادید'
  answers: [
    'واقعیت ها را تدریس کنید'
    'نظریه ها را شرح دهید؟'
  ]
}, {
  question: 'هنگام گفتگو بیشتر تمایل دارید'
  answers: [
    'تمجید کنید'
    'سرزنش کنید؟'
  ]
}, {
  question: 'آیا معمولا'
  answers: [
    'آزادانه احساسات خود را نشان می دهید'
    'احساسات خود را نشان نمی دهید؟'
  ]
}, {
  question: 'اگر قرار باشد که کاری خاص را از پیش، در زمانی خاص، انجام دهید، آیا'
  answers: [
    'طبق برنامه عمل کردن برای شما خوشایند است'
    'از در چهارچوب قرار گرفتن احساس ناخوشایندی می کنید؟'
  ]
}, {
  question: 'معمولا با کدام شخص، راحت تر ارتباط برقرار می کنید؟ '
  answers: [
    'با فردی تخیلی، یا'
    'با فردی واقع بین'
  ]
}, {
  question: 'احساس می کنید که کدامیک عیب بدتری به شمار می آید؟ '
  answers: [
    'همدردی نکردن'
    'استدلال پذیر نبودن؟'
  ]
}, {
  question: 'وقتی غریبه ها به شما توجه می کنند '
  answers: [
    'احساس ناراحتی می کنید'
    'اصلا ناراحت نمی شوید؟'
  ]
}, {
  question: 'اگر بخواهید عمل خاصی را انجام دهید، کدامیک از این دو گزاره برایتان جالب تر به نظر می رسد؟ '
  answers: [
    'مردم خیلی دوست دارند که شما آن را انجام دهید'
    'این منطقی ترین کاری است که انجام دهید.'
  ]
}, {
  question: 'آیا عادت دارید '
  answers: [
    'به هیچ کس اعتماد نکنید، یا حداکثر به یک نفر اعتماد کنید'
    'تعدادی دوست دارید که به آن ها اعتماد می کنید؟'
  ]
}, {
  question: 'آیا ترجیح می دهید '
  answers: [
    'قرار ملاقات ها، وعده ها و میهمانی ها را از پیش تعیین کنید'
    'فردی باشید که در لحظه آخر بتوانید آزادانه آن جایی را که تمایل دارید انتخاب کنید؟'
  ]
}, {
  question: 'آیا '
  answers: [
    'ترجیح می دهید کارها را در دقیقه آخر انجام دهید'
    'انجام دادن کارها در دقیقه آخر عصبی تان می کند؟'
  ]
}, {
  question: 'آیا '
  answers: [
    'فکر می کنید همه کسانی را که دوست دارید، می دانند که دوستشان دارید، یا'
    'به بعضی افراد علاقمند هستید بی آنکه بگذارید آن ها بدانند؟'
  ]
}, {
  question: 'در انجام کاری که بسیاری از مردم انجام می دهند، ترجیح می دهید '
  answers: [
    'آن را به شیوه پذیرفته شده انجام دهید'
    'روش خاص خود را برای انجام آن ابداع کنید؟'
  ]
}, {
  question: 'فکر می کنید وجود کدامیک در فرد نقص بیشتری است؟ '
  answers: [
    'خیلی احساساتی بودن'
    'به اندازه کافی احساساتی نبودن؟'
  ]
}, {
  question: 'وقتی با گروهی از افراد هستید معمولا ترجیح می دهید '
  answers: [
    'به صحبت گروهی بپردازید'
    'هر بار فقط با یک فرد صحبت کنید؟'
  ]
}, {
  question: 'آیا فکر می کنید که داشتن یک برنامه روزانه '
  answers: [
    'راحت ترین روش برای انجام دادن کارهاست'
    'حتی اگر ضروری باشد، رنج آور است'
  ]
}, {
  question: 'در شیوه زندگی تان، ترجیح می دهید '
  answers: [
    'متفاوت باشید، یا'
    'متعارف عمل کنید؟'
  ]
}, {
  question: 'احساس می کنید کدامیک عیب بدتری در ارتباطات بین فردی به شمار می رود؟ '
  answers: [
    'گرمی زیاد نشان دادن'
    'به اندازه کافی گرم نبودن'
  ]
}, {
  question: 'در بین دوستانتان، آیا '
  answers: [
    'یکی از آخرین کسانی هستید که خبرها را می شنود'
    'همه نوع خبری در مورد هر کسی دارید؟'
  ]
}, {
  question: 'آیا معمولا '
  answers: [
    'برای احساس بیشتر از منطق ارزش قایل هستید، یا'
    'برای منطق بیشتر از احساس؟'
  ]
}, {
  question: 'در یک محفل اجتماعی، آیا '
  answers: [
    'سعی می کنید کسی را که دوست دارید با او صحبت کنید به گوشه ای بکشید'
    'با گروه می جوشید؟'
  ]
}, {
  question: 'وقتی که کار خاصی برای انجام دادن دارید، آیا ترجیح می دهید '
  answers: [
    'پیش از آغاز کار، با دقت آن را ساماندهی کنید'
    'آنچه ضروری است را حین انجام کار متوجه شوید؟'
  ]
}, {
  question: 'آیا '
  answers: [
    'روزمره بودن برایتان ساده تر است'
    'متنوع بودن؟'
  ]
}, {
  question: 'در میهمانی ها، آیا '
  answers: [
    'گاهی کسل می شوید، یا'
    'همیشه به شما خوش می گذرد؟'
  ]
}, {
  question: 'در زندگی شخصی، وقتی مسئولیتی را به پایان می رسانید'
  answers: [
    'می دانید کار بعدی چیست و آماده ی درگیر شدن با آن هستید، یا'
    'تا پیشامد بعدی از آرامش خود خوشنود هستید؟'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'عبارت'
    'مفهوم'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'متقاعد کردن'
    'درک کردن'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'صحبت کردن'
    'نوشتن'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'وقت شناس'
    'راحت گیر (غیر سخت گیر)'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'ساختن'
    'اختراع کردن'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'موافقت کردن'
    'پرسیدن'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'واقعی'
    'انتزاعی'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'مزیت'
    'برکت'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'آرام'
    'سرزنده'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'منضبط'
    'آسان گیر'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'حروفی'
    'ارقامی'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'تحلیل کردن'
    'همدردی'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'تولید'
    'طراحی'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'نرم'
    'سخت'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'ساکت'
    'پرحرف'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'منظم'
    'خودمانی'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'علامت مشخص'
    'نماد'
  ]
}, {
  question: 'کدام عبارت از هر جفت عبارت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'پایبند به اندیشه خود'
    'دلگرم و امیدوار'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'پذیرش'
    'تغییر'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'چه کسی؟'
    'چه چیزی؟'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'برنامه ریز'
    'بدون برنامه'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'شناخته شده'
    'نا شناخته'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'محتاط'
    'خوش خیال'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'واقعیت ها'
    'ایده ها'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'ملایم'
    'محکم'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'زیر بنا'
    'روبنا'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'عدالت'
    'بخشندگی و دست و دل باز بودن'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'نظریه'
    'تجربه'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'غیر انتقادی'
    'انتقادی'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'مبتکر'
    'احساسی'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'مایع'
    'جامد'
  ]
}, {
  question: 'کدام لغت از هر جفت لغت برای شما جالب تر است؟ به معنی لغت ها فکر کنید نه اینکه چطور به نظر می رسند. '
  answers: [
    'دلسوزی'
    'دوراندیشی'
  ]
}, {
  question: 'کدامیک تمجید بیشتری از یک فرد است؟ '
  answers: [
    'بصیرت و بینش دارد'
    'عقل سلیم دارد؟'
  ]
}, {
  question: 'بیشتر مراقب کدامیک هستید؟ '
  answers: [
    'احساست افراد'
    'حق و حقوق آن ها'
  ]
}, {
  question: 'در یک مهمانی دوست دارید '
  answers: [
    'کاری می کنید که مراسم به خوبی انجام شود'
    'می گذارید هر کسی به میل خودش خوش بگذراند؟'
  ]
}, {
  question: 'آیا به طور کلی ترجیح می دهید '
  answers: [
    'برای دیدار کسی از قبل برنامه ریزی می کنید'
    'آزاد باشید و لحظه ای عمل می کنید؟'
  ]
}, {
  question: 'هنگامی که با گروهی از دوستان نزدیک خودتان هستید، آیا '
  answers: [
    'بیشتر از بقیه صحبت می کنید؟ '
    'کمتر از بقیه؟'
  ]
}, {
  question: 'آیا به طور طبیعی '
  answers: [
    'به مردم بیشتر از اشیاء علاقمندید'
    'به اشیا و نحوه ی کار آن ها بیشتر از روابط انسان ها علاقه مندید؟'
  ]
}, {
  question: 'در یک گروه بزرگ، اغلب '
  answers: [
    'دیگران را به هم معرفی می کنید'
    'صبر می کنید تا معرفی بشوید؟'
  ]
}, {
  question: '.وقتی برای یک روز، جایی می روید، آیا ترجیح می دهید '
  answers: [
    'برای اینکه چه کاری و چه موقع انجام دهید برنامه ریزی کنید'
    'راحت باشید و فقط راه بیافتید؟'
  ]
}, {
  question: 'زمانی که در مورد یک پیشامد فکر می کنید ترجیح می دهید '
  answers: [
    'در این مورد با شخصی صحبت کنید '
    'در مورد آن خوب فکر می کنید؟'
  ]
}, {
  question: 'آیا افرادی که تازه با شما آشنا می شوند می توانند بگویند به چه علاقه دارید؟ '
  answers: [
    'خیلی سریع، یا'
    'تنها پس از آن که شما را خوب شناختند'
  ]
}, {
  question: 'در مورد کارهای روزمره ترجیح می دهید '
  answers: [
    'صبح اول وقت آن ها را انجام دهید'
    'یا در ضمن فرصت های پیش آمده حین انجام کارهای جالب تر دیگر، آن ها را انجام دهید؟'
  ]
}, {
  question: '.آیا معمولا منظورتان '
  answers: [
    'بیشتر از آن چه می گویید، می باشد'
    'کمتر از آن چه می گویید است؟'
  ]
}, {
  question: 'آیا '
  answers: [
    'از اتمام کارها پیش از زمان موعود احساس رضایت می کنید'
    'از سرعت و کار آمدی خود در لحظات آخر انجام کار لذت می برید؟'
  ]
}, {
  question: 'وقتی که غریبه ها را ملاقات می کنید، آیا '
  answers: [
    'برایتان خوشایند است، یا دست کم راحت است'
    'زحمت زیادی برایتان دارد؟'
  ]
}, {
  question: 'وقتی در جلسه ای راجع به چیزی نظری دارید که باید گفته شود، آیا '
  answers: [
    'آن را مطرح می کنید، یا'
    'در مورد گفتن ان تردید می کنید'
  ]
}, {
  question: 'آیا در مورد معنی پرسش های این آزمون دوست داشتید '
  answers: [
    'خیلی سوال کنید، یا'
    'کم؟'
  ]
}]